; -------------------------------------------------------------------------------------------------
;
; 7z SFX Builder Language File
;
; Translation Instructions:
;	File extension must be '.ini' in order to make 7z SFX Builder load language file.
;	DON'T remove SECTION NAMES! (ex: [LangOptions], [Global] ...)
;	Update your and language information in 'LangOptions' section
;	Guardar the file in Unicode format
;	E-mail new language archivos to mirza.b.1695@gmail.com for inclusion in main insttodoer.
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered como a "hotkey" for that function.
;	\n - indicates a newline character, which will be replaced when displayed.
;	\~n - indicates double newline character.
;	\s - indicates a special strings (genertodoy file nombres)
;		The order and number of \s variables is very important and should not be modified.
;	\~s - same como \s. only quotes are added.
;
; -------------------------------------------------------------------------------------------------

[LangOptions]
LANG_NAME="Spanish"
LANG_NATIVE_NAME="Español"
VERSION=2.0.7
NAME=Alvaro Freire Porta
CONTACT=mailto:alvafreire@gmail.com

[Global]
TIP_ADD="Añadir"
TIP_EDIT="Editar"
TIP_DELETE="Borrar"
TIP_DELETE_ALL="Borrar Todo"
TIP_MOVE_UP="Mover Arriba"
TIP_MOVE_DOWN="Mover Abajo"
BTN_SAVE="Guardar"
BTN_CANCEL="Cancelar"
CHK_QUOTES="Encerrar en comillas"
LST_SEC_QUOTES="Comillas"
ERROR_MSG_TITLE="Error!"
WARNING_MSG_TITLE="Cuidado!"
INFORMATION_MSG_TITLE="Información"
QUESTION_MSG_TITLE="Pregunta"
BTN_Aceptar="Aceptar"
TEST="Test"
TIP_BROWSE="Buscar Archivo"
TIP_OPEN="Abrir ubicación de Archivo"

[Menu]
MENU_FILE="&Archivo"
MENU_SETTINGS="&Ajustes"
MENU_HELP="&Ayuda"
MI_OPEN="&Abrir archivo..."
MI_RELOAD="R&eabrir"
MI_SAVE="&Guardar"
MI_SAVE_AS="Guardar &como..."
MI_CLOSE="&Cerrar"
SUB_MENU_RECENT_FILES="&Archivos recientes"
MI_CLEAR_LIST="B&orrar lista"
MI_EXIT="S&alir"
MI_OPTIONS="&Opciones"
SUB_MENU_LANG="&Lenguaje"
MI_HELP="Ayud&a"
MI_SITE="&Sitio del proyecto"
MI_ABOUT="Acerca de"
MI_PRESET_MANAGER="Gestor de Presets"

[ToolbarTips]
OPEN="Abrir archivo"
SAVE="Guardar"
SAVE_AS="Guardar como"
CLOSE="Cerrar archivo"
TEST="Test"
PRESET="Manejar Presets"
MAKE_SFX="Crear SFX"
OPTIONS="Opciones del Programa"

[TabNames]
MAIN="Principal"
TITLE_TEXT="Título/Texto"
DIALOGS="Diálogos"
RUN="Ejecutar"
DELETE="Borrar"
SHORTCUTS="Accesos directos"
SET_ENV="SetEnvironment"
OUTPUT="Salida"
SFX="SFX"

[Tab_Main]
CHK_TEMP_MODE="Modo Temporal"
CHK_SKIP_LOCKED="Saltar archivos de sistema bloqueados"
CHK_DELETE_SFX="Borrar archivo SFX después de la extracción"
CHK_BPT="Tiempo de espera BeginPrompt (segundos):"
CHK_XDWIDTH="Ancho mínimo ventana ExtractDialog (pixels):"
CHK_XPWIDTH="Ancho mínimo ventana ExtractPath (pixels):"
RAD_OW_MODE_1="Sobreescribir todos los archivos"
RAD_OW_MODE_2="No sobreescribir archivos"
RAD_OW_MODE_3="Sobreescribir archivos antiguos"
RAD_GUI_MODE_1="Mostrar todos los GUI"
RAD_GUI_MODE_2="Deshabilitar Cancelar mientras se extrae"
RAD_GUI_MODE_3="Ocultar todas las ventanas GUI"
GRP_OW_MODE="Modo Sobreescribir:"
GRP_GUI_MODE="Modo GUI:"
LBL_EXT_PATH="Ruta de Extracción:"
MI_SFX_NAME="Nombre SFX "
MI_SFX_PATH="Ruta SFX "
TIP_EDIT="Click para editar"
TIP_INSERT="Click para insertar variables"
TIP_RELOAD="Recargar"
TIP_OPEN="Abrir con Editor de texto"

[Tab_TitleText]
GRP_TITLE="Título"
GRP_TEXT="Texto"
LBL_WIN_TITLE="Título de ventana:"
LBL_EXT_PATH_WIN_TITLE="Título de ventana ExtractPath:"
LBL_EXT_WIN_TITLE="Título Extracción:"
LBL_ERROR_WIN_TITLE="Título Mensaje de Error:"
LBL_WARN_WIN_TITLE="Título Mensaje de Aviso:"
LBL_PASSWD_TITLE="Título Password:"
LBL_PASSWD_TEXT="Texto Password:"
LBL_EXT_CANCEL_TEXT="Texto Cancelar Extracción:"

[Tab_RunProgram]
LST_SEC_PARAMETER="Parámetro"
LST_SEC_PREFIX="Prefijo"
LST_SEC_FILE_FOLDER="Ruta del archivo"
LST_SEC_COMMANDS="Comandos"

[Tab_Delete]
LST_SEC_PARAMETER="Parámetro"
LST_SEC_FILE_FOLDER="Ruta de Archivo/Directorio"

[Tab_Shortcuts]
LST_SEC_PARAMETER="Parámetro"
LST_SEC_PATH="Destino"
LST_SEC_SRC="Ruta del ejecutable"
LST_SEC_CMDS="Comandos"
LST_SEC_NAME="Nombre"
LST_SEC_DESC="Descripción"
LST_SEC_DEST="Carpeta"
LST_SEC_WD="Ruta de trabajo"
LST_SEC_ICON="Icono"
LST_SEC_INDEX="Indice"

[Tab_SetEnvironment]
LST_SEC_NAME="Nombre de Variable"
LST_SEC_VALUE="Valor"

[Tab_SFX]
BTN_SELECT="Seleccionar..."
BTN_MAKE_SFX="Crear SFX"
BTN_SFX_OPTIONS="Opciones SFX"
BTN_EDIT_VERS="Editar Info de la Versión"
CHK_INCLUDE_PATH="Incluir ruta en el archivo de configuración"
CHK_USE_SELECTED_CFG="Usar archivo de configuración selecionado"
GRP_SFX_FILES="Archivos SFX"
GRP_SFX_ICON="Icono"
LBL_CONFIG_FILE="Archivo de configuración:"
LBL_7Z_ARCHIVE="Archivo 7z:"
LBL_SFX_MODULE="Módulo SFX:"
LBL_SFX_PATH="Ruta SFX:"
LBL_SFX_ICON="Icono SFX:"

[GUI_ProgramOptions]
GUI_TITLE="Opciones del Programa"
BTN_INTEGRATE="Integrar el Programa en el menú contextual"
BTN_EXPORT="Exportar..."
MI_REGISTRY="Archivo de registro..."
MI_INI="Archivo INI..."
CHK_USERMODE="Guardar ajustes en el registro"
CHK_AUTODEFMOD="Usar el Módulo por defecto si el archivo de configuración cargado no lo contiene"
CHK_IGNORE_EMPTY="No crear versiones con el dato "Info" vacío"
CHK_AUTO_NAME_SFX="Crear archivo SFX en el directorio de archivos si la ruta del SFX no está definida"
CHK_OVERWRITE_FILES="Sobreescribir archivos SFX existentes"
GRP_PROGRAM="Programa"
GRP_SFX="SFX"
LBL_LANGUAGE="Lenguaje:"

[GUI_PresetManager]
GUI_TITLE="Preset Manager"
GUI_TITLE2="Nuevo Preset"
GUI_TITLE3="Renombrar Preset"
BTN_NEW="Nuevo"
BTN_LOAD="Cargar"
BTN_SAVE="Guardar"
BTN_EDIT="Editar nombre"
BTN_DELETE="Borrar"
LBL_NAME="Nombre del Tipo de Preset:"

[GUI_ArchiveSets]
CHK_SUBFILES="Archivar sólo archivos/directorios localizados in la carpeta dada"
LBL_DRAGDROP="Puedes usar la función Arrastrar y Soltar para añadir archivos/carpetas"
TIP_ADDFILE="Añadir archivo(s)"
TIP_ADDFOLDER="Añadir carpeta"

[GUI_SFXOpts]
GUI_TITLE="Opciones SFX"
TAB_SFX_OPTIONS="Opciones SFX"
TAB_ARCHIVE_FILES="Archivos de almacenamiento"
CHK_USE_UPX="Comprimir el módulo SFX con UPX"
CHK_USE_SFX_MOD="Usar el sigiente módulo SFX:"
CMB_USE_7ZIP1="Siempre usar 7-Zip"
CMB_USE_7ZIP2="Usar sólo 7-Zip si los archivos de almacenamiento son especificados"
CMB_USE_7ZIP3="No usar 7-Zip si Archivo 7z es especificado"
CMB_USE_7ZIP4="Nunca usar 7-Zip"
LBL_PATH="Ruta 7-Zip"
TIP_BROWSE="Selecionar ruta 7-Zip"
TIP_CONFIG="Configuración 7-Zip"
7ZIP_TITLE="Configuración 7-Zip"
7ZIP_LEVEL="Nivel de compresión:"
7ZIP_METHOD="Método de compresión:"
7ZIP_DICT="Tamaño de diccionario:"
7ZIP_SOLID="Tamaño Bloque Sólido:"

[GUI_VersionInfo]
GUI_TITLE="Editar info de versión de archivo"
BTN_LOAD="Cargar"
MI_LOAD_SFXMOD="Desde módulo SFX seleccionado"
MI_LOAD_FILE="Desde archivo..."
MI_LOAD_VALUES="Cargar guardado"
MI_SAVE_VALUES="Guardar valores actuales"
CHK_INCLUDE="Incluir información en el archivo de configuración"
CHK_CHANGE_VERS="Cambiar versión info"

[GUI_Gui.MiscFlags]
GUI_TITLE="Editar GUI/Misc Flags"
BTN_NEW="Nuevo"
BTN_LOAD="Cargar"
BTN_RESET="Reset"
BTN_DELETE="Borrar"
LBL_GUI_FLAG_1="Mostrar el porcentaje de extracción en la Barra del Título a la derecha (por defecto - en la izquierda)"
LBL_GUI_FLAG_2="No mostrar el porcentaje de extracción en la Barra del Título"
LBL_GUI_FLAG_4="Mostrar el porcentaje de extracción bajo la Barra del Título"
LBL_GUI_FLAG_8="Usar estilo Windows XP (esquema)"
LBL_GUI_FLAG_16="Usar fuente en negrita para el porcentaje de extracción"
LBL_GUI_FLAG_32="Mostrar icono en la ventana de progreso de extracción"
LBL_GUI_FLAG_64="Usar ventana 'BeginPrompt' para especificar la ruta de extracción"
LBL_GUI_FLAG_128="Usar ventana separada para especificar la ruta de extracción"
LBL_GUI_FLAG_256="Confirme la cancelación de la instalación/extracciónn"
LBL_GUI_FLAG_512="No mostrar un icono en la Barra de Título de todas las ventanas y activar [Alt+Tab]"
LBL_GUI_FLAG_1024="Mostrar un icono en la ventana para especificar ruta de extracción"
LBL_GUI_FLAG_2048="Mostrar un icono en la ventana 'BeginPrompt'"
LBL_GUI_FLAG_4096="Cambiar icono y nombres de los botones. En lugar de 'Si'-'No' será 'Aceptar'-'Cancelar'"
LBL_GUI_FLAG_8192="No mostrar Barra de Progreso en la Barra de Tareas en Windows 7 o posterior"
LBL_GUI_FLAG_16384="Mostrar símbolo '&&' en los textos"
LBL_MISC_FLAG_1="No verificar el espacio libre en disco necesario para la extracción"
LBL_MISC_FLAG_2="No verificar el espacio libre en disco necesario para la extracción"
LBL_MISC_FLAG_4="Requiere Privilegios de Administrador para el toda la operación"
LBL_MISC_FLAG_8="Mostrar ventana de solicitud de contraseña después de las ventanas 'BeginPrompt' y 'ExtractPath'"

[GUI_RunProgram]
GUI_TITLE="Agregar programas para ejecutar después de la extracción"
GUI_PFX_TITLE="Editar prefijos"
LBL_PARAMETER="Parámetro:"
LBL_FILE="Archivo:"
LBL_PREFIX="Prefijo:"
LBL_COMMANDS="Comandos:"

[GUI_Delete]
GUI_TITLE="Añadir archivos para borrar después de la extracción"
LBL_PARAMETER="Parámetro:"
LBL_FILE="Archivo/Carpeta:"

[GUI_Shortcuts]
GUI_TITLE="Agregar Accesos Directos para crear"
RAD_DESKTOP="Escritorio"
RAD_START_MENU="Menú Inicio"
RAD_PROGRAMS="Menú Inicio\Programas"
RAD_STARTUP="Inicio"
RAD_CURRENT_USER="Usuario Actual"
RAD_ALLUSERS="Todos los usuarios"
GRP_CREATION_PATH="Donde crear"
GRP_CREATE_FOR="Crear para"
GRP_PARAMETER="Parámetro:"
LBL_SOURCE_FILE="Archivo Fuente:"
LBL_ARGUMENTS="Argumentos:"
LBL_NAME="Nombre Acc. Dir.:"
LBL_DESCRIPTION="Descripción Acc. Dir.:"
LBL_DEST_FOLDER="Carpeta de destino:"
LBL_WORKING_DIR="Directorio de trabajo:"
LBL_ICON_FILE="Archivo del icono:"
LBL_ICON_INDEX="Indice del icono:"

[GUI_SetEnvironment]
GUI_TITLE="Crear variables de entorno"
LBL_NAME="Nombre:"
LBL_VALUE="Valor:"

[GUI_MakeSFX]
GUI_TITLE="Creando SFX..."
BTN_OPEN="Buscar"
BTN_RUN="Ejecutar SFX"
BTN_CLOSE="Cerrar"
REPORT_PREP="Preparando..."
REPORT_ARCHIVE1="Creando archivo..."
REPORT_ARCHIVE2="7-Zip no existe!"
REPORT_ARCHIVE3="El archivo no existe: \~s"
REPORT_ARCHIVE4="Archivo creado satisfactoriamente"
REPORT_ARCHIVE5="No se puede crear el archivo!"
REPORT_ERROR1="No se encuantra el archivo de configuración: \~s"
REPORT_ERROR2="El siguiente archivo no es un archivo de configuración 7z SFX: \~s"
REPORT_ERROR3="Error mientras se creaba el archivo SFX!"
REPORT_ICON1="Cambiando icono SFX..."
REPORT_ICON2="Icono SFX cambiado satisfactoriamente"
REPORT_ICON3="No se puede cambiar el icono SFX!"
REPORT_VERSINFO1="Actualizando información de la versión..."
REPORT_VERSINFO2="Información de la versión actualizada satisfactoriamente"
REPORT_VERSINFO3="No se puede actualizar la información de la versión!"
REPORT_UPX1="Comprimiendo con UPX..."
REPORT_UPX2="Compresión completada satisfactoriamente"
REPORT_UPX3="No se encuentra el archivo "upx.exe"!"
REPORT_BUILD1="Construyendo SFX..."
REPORT_BUILD2="Error mientras se construía el archivo SFX!"
REPORT_FINISH="SFX creado satisfactoriamente en: \~s"

[MessageBoxes]
; File open/save operations
MSGBOX1_1="No se puede encontrar el archivo de idioma!"
MSGBOX1_2="El archivo especificado no existe!"
MSGBOX1_3="El archivo no está cargado o no existe!"
MSGBOX1_4="El archivo de configuración especificado no existe!"
MSGBOX1_5="Quieres abrir el archivo: \~n\~s - ?"
MSGBOX1_6="\~s\nno es un archivo de configuración 7z SFX!\~nQuieres cargarlo de todas formas?"
MSGBOX1_7="El tamaño del archivo es más grande que un archivo de configuración normal!\nQuieres cargarlo de todas formas?"
MSGBOX1_8="El archivo requerido para la operación actual no se encuentra:\n\s"
MSGBOX1_9="Este archivo no contiene un archivo de configuración! No se puede continuar!"
MSGBOX1_10="Estás seguro de que deseas volver a cargar el archivo?"
MSGBOX1_11="La configuración actual no está guardada. Quieres guardarla ahora?"
MSGBOX1_12="No se puede leer o escribir el archivo! Asegúrese de que tiene Privilegios de Administrador."
; SFX creation
MSGBOX2_1="La ruta del archivo SFX especificado no existe!"
MSGBOX2_2="El módulo SFX no está especificado!"
MSGBOX2_3="El módulo SFX especificado no existe o no tiene el formato requerido!"
MSGBOX2_4="Los ficheros del archivo no están especificados!"
MSGBOX2_5="El archivo no está especificado!"
MSGBOX2_6="El archivo especificado no existe o no tiene el formato requerido!"
MSGBOX2_7="Quieres sobreescribir el archivo existente: \~n\~s - ?"
MSGBOX2_8="7-Zip no existe!"
MSGBOX2_9="Quieres utilizar siguiente archivo: \~n\~s - ?\~nClick en 'No' si desea crear un nuevo archivo con los ficheros definidos en el archivo de configuración."
; Other operations
MSGBOX3_1="Programa integrado con éxito en el menú contextual."
MSGBOX3_2="Pulsa 'Aceptar' para cerrar la ventana para testear"
MSGBOX3_3="Quieres sobreescribir los valores existentes?"
MSGBOX3_4="Por favor, selecciona al menos un elemento."
MSGBOX3_5="Por favor, selecciona sólo un elemento."
MSGBOX3_6="Está seguro de que quieres eliminar lo(s) elemento(s) seleccionado(s)?"
MSGBOX3_7="Estás seguro de que quieres eliminar todos los elementos?"
MSGBOX3_8="El dato especificado no es válido o está vacío!"
MSGBOX3_9="El archivo no está especificado!"
